<a href="https://colab.research.google.com/github/ga0808/sql/blob/main/New%EC%8B%A4%EC%8A%B52.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#ddl, dml, dcl, tcl

In [ ]:
#실습 1
# 아래에 hire_date가 1997-07-07인 직원만 조회하는 쿼리를 작성해주세요.
SELECT * FROM employees
WHERE hire_date LIKE '1997-07-07';

#팁 얘기는 안다루고 넘어가기 !!!!!
#소문자 > 대문자 순으로 조회 진행한다는 얘기 - 틀린 것 같음


#like는 DBMS마다 조회가 달라지는데 - mysql/mariadb는 대소문자 구분 안하고, oracle은 함
#이름 컬럼에서 'john', 'John', 'JOHN' 데이터가 있는데 - 'john'을 조회한다면

교안으로

In [ ]:
# 실습 2

# 책들의 정보가 담겨있는 테이블의 구조를 조회합니다. 수정하실 필요는 없습니다.
DESC book;

# 아래에 제목이 The Little로 시작하는 책만 조회하는 쿼리를 작성해주세요.
select * from book
where title like 'The Little%';

# 아래에 제목에 and가 포함된 책만 조회하는 쿼리를 작성해주세요.
select * from book
where title like '%and%';

# 아래에 제목이 Rings로 끝나는 책만 조회하는 쿼리를 작성해주세요.
select * from book
where title like '%Rings';

In [ ]:
# 실습 3

# 아래에 hire_date에 7이 들어가는 직원을 조회하는 쿼리를 작성해주세요.
SELECT * FROM employees
WHERE hire_date
LIKE '%7%';

교안으로

In [ ]:
#퀴즈2 - 2

In [ ]:
# 실습 4 - ORDER BY

# book 테이블의 구조를 조회합니다. 수정하실 필요는 없습니다.
DESC book;

# book 테이블의 내용을 조회해 봅시다. 이때 책 제목을 기준으로 오름차순으로 조회해 봅시다.
SELECT * FROM book
ORDER BY title ASC;

In [ ]:
# 실습 5 - ORDER BY2

# salaries 테이블의 내용을 출력해 봅시다. 이때 연봉액 제목을 기준으로 오름차순으로 출력해 봅시다.
SELECT * FROM salaries
ORDER BY salary ASC;

In [ ]:
#퀴즈3 - 1

In [ ]:
#실습 6
#INSERT문을 이용해 쿼리를 작성해 보세요.

# INSERT INTO 테이블명(컬럼명들)
# VALUES(명시한 컬럼 순서대로 값)

# INSERT INTO 테이블명
# VALUES(테이블 컬럼 순서대로 값)



INSERT INTO employees
VALUES(10001, '1953-09-02', 'Georgi', 'Facello', 'M', '1986-06-26', NULL)
;

#값을 잘 넣었는지 확인하는 코드입니다. 수정하지마세요!
SELECT * FROM employees
;


#만약에 - 특정 컬럼만 값을 명시해서 삽입하게 된다면?
#정의한 테이블 구조마다 다름
#만약 값이 없을때 설정된 기본값이 있다면 기본값으로 삽입됨
#그러나 만약 삽입하지 않은 컬럼이 설정된 기본값도 없는데, null을 허용하지 않을 경우에 에러 날 수 있음

In [ ]:
#퀴즈 4 - UPDATE

In [ ]:
#실습7 - 수정하기
#대출 반납의 정보가 담긴 테이블의 구조를 조회합니다. 수정하실 필요는 없습니다.
DESC rental;

#반납 시간을 수정하는 쿼리를 작성해 보세요.
# UPDATE 테이블명
# SET 변경할 컬럼 = 변경할 값
# WHERE 변경을 수행할 값(행)들에 대한 조건;


UPDATE rental
SET rental_end_date = '2019-04-05 12:00:30'
WHERE user_id = 1000;

# 대출 반납 상태를 조회합니다. 반납시간이 올바르게 추가되었는지는 실행버튼을 통해 확인할 수 있습니다.
SELECT * FROM rental;

In [ ]:
#실습8 - 풀어보세요
#UPDATE문을 이용해 쿼리를 작성해 보세요.
UPDATE employees
SET birth_date = '1953-09-01'
WHERE emp_no = 10001;

#값을 잘 수정했는지 확인하는 코드입니다. 수정하지마세요!
SELECT * FROM employees;

In [ ]:
# 퀴즈 5 - DELETE

In [ ]:
#실습 9
# -- 잃어버린 책 2권을 book 테이블에서 삭제하여 봅시다.
# DELETE from 테이블명
# WHERE 삭제하고자 하는 데이터 (행) 조건;

DELETE from book
WHERE title = 'Harry Potter and the Philosopher\'s Stone';
#역슬래시(\) 필요 !
#-> 기존에 '(따옴표)가 문자열을 뜻하는 문법을 가지고 있는 문자이기 때문에
#   데이터 내 문자 자체로 따옴표를 쓰려면
#   특수한 문법이 있는 문자가 아닌 데이터라고 명시를 해줘야함

DELETE from book
WHERE where title = 'The Lord of the Rings';

# -- 전체 책의 정보와 회원정보를 조회합니다. 수정하실 필요는 없습니다.
SELECT * FROM book;

In [ ]:
#실습 10 - 직접
# DELETE문을 이용해 쿼리를 작성해 보세요.
DELETE FROM employees
WHERE emp_no = 10005;

# 값을 잘 삭제했는지 확인하는 코드입니다. 수정하지마세요!
SELECT * FROM employees;

In [ ]:
# 미션1 - 가게 db
# -- 아래에 문제 설명대로 정보를 추가해 봅시다.
ISNERT INTO product
VALUES(1, 'carrot', 100, '2019-04-10', 1000, 900);

ISNERT INTO product
VALUES(2, 'tea', 1000, '2020-02-10', 1000, 900);

ISNERT INTO product
VALUES(3, 'clock', 100, null, 200000, 180000);

# -- product테이블 전체를 조회해 봅시다.
select * from product;

In [ ]:
#미션2 - 가게 db
# -- 아래에 문제 설명대로 수정해 봅시다.

# UPDATE 테이블명
# SET 변경할 컬럼 = 변경할 값
# WHERE 변경을 수행할 값(행)들에 대한 조건;

UPDATE product
SET stock = 0
where id = 1;

UPDATE product
SET stock = 50
where id = 3;

UPDATE product
SET selling_price = 800
where id = 2;

# DELETE from 테이블명
# WHERE 삭제하고자 하는 데이터 (행) 조건;
DELETE FROM product
where id = 4;

# 수정된 product테이블 전체를 조회합니다. 만약 product를 수정하지 않았다면 수정되지 않은 값이 조회됩니다.
select * from product;

In [ ]:
#미션3 - 발언권 주주
# -- 아래에 미션을 수행하는 코드를 작성해 봅시다.
select * from shareholder
order by stock desc;

교안으로